/*********************************************************
* @brief	スコアデータ
* @date		2022/10/04
********************************************************/
#pragma once
#include <string>

const int WORD_SIZE = 50;//文字列読み取の上限

//==========  成績データ構造体 ==========
struct ScoreData
{
	//@brief	スコア
	int score;
	//@brief	ユーザー名
	std::string name;

	/*********************************************************
	* @brief	コンストラクタ　デフォルト値
	********************************************************/
	ScoreData() :
		score(0),
		name("dummy") {};

	/*********************************************************
	* @brief	コンストラクタ　データに初期値を代入
	********************************************************/
	ScoreData(const int _score, const std::string _name) :
		score(_score),
		name(_name) {};
};